# Pandas SQL Operations

In [1]:
#import Panda Library
#import SQL Lite3 Library

In [3]:
import pandas as pd
import sqlite3

In [4]:
#Create SQL Tabel
create_table = '''
create table Student_score
(Id INTEGER, Name VARCHAR(20), Math REAL, Science REAL);
'''

In [6]:
create_table

'\ncreate table Student_score\n(Id INTEGER, Name VARCHAR(20), Math REAL, Science REAL);\n'

In [9]:
#Execute the SQL statement
executeSQL = sqlite3.connect(":memory:")
executeSQL.execute(create_table)
executeSQL.commit

In [11]:
SQL_Query = executeSQL.execute("SELECT * from Student_score")

In [12]:
resultSet = SQL_Query.fetchall()

In [13]:
resultSet

[]

In [14]:
insertSQL = [(10,'Jack',12,18),(29,'Tom',14,15),(65,'Ram',17,18),(5,'Steve',18,16)]

In [15]:
insertStatement = "Insert into Student_score values(?,?,?,?)"

In [16]:
executeSQL.executemany(insertStatement,insertSQL)

In [17]:
executeSQL.commit()

In [19]:
SQL_Query = executeSQL.execute("Select * from Student_score")

In [20]:
resultSet = SQL_Query.fetchall()

In [21]:
resultSet

[(10, 'Jack', 12.0, 18.0),
 (29, 'Tom', 14.0, 15.0),
 (65, 'Ram', 17.0, 18.0),
 (5, 'Steve', 18.0, 16.0)]

In [38]:
df_student_record = pd.DataFrame(resultSet,columns=list(zip(*SQL_Query.description))[0])

In [39]:
df_student_record

   Id   Name  Math  Science
0  10   Jack  12.0     18.0
1  29    Tom  14.0     15.0
2  65    Ram  17.0     18.0
3   5  Steve  18.0     16.0